Repository: Stackato-Apps/stackato-apps
Catalog: apps/bloodhound/trac/trac/locale/*/LC_MESSAGES/tracini.po
Languages: sv

source: Username for SMTP server. (''since 0.9'')
sv: Användarnamn för SMTP-servern. (''sedan 0.9'')

source: Password for SMTP server. (''since 0.9'')
sv: Lösenord för SMTP-servern. (''sedan 0.9'')

source: Use SSL/TLS to send notifications over SMTP. (''since 0.10'')
sv: Använd SSL/TLS för att skicka aviseringar över SMTP. (''sedan 0.10'')

source: Path to the sendmail executable. The sendmail program must accept the `-i` and `-f` options. (''since 0.12'')
sv: Sökväg till exekveringsfil för sendmail. Sendmail-programmet måste acceptera flaggorna `-i` och `-f`. (''sedan 0.12'')

source: Name of the component implementing `IPermissionStore`, which is used for managing user and group permissions.
sv: Namnet på komponenten som implementerar `IPermissionStore`, som används för att hantera användar- och grupprättigheter.

source: List of components implementing `IPermissionPolicy`, in the order in which they will be applied. These components manage fine-grained access control to Trac resources. Defaults to the DefaultPermissionPolicy (pre-0.11 behavior) and LegacyAttachmentPolicy (map ATTACHMENT_* permissions to realm specific ones)
sv: Lista av komponenter som implementerar `IPermissionPolicy`, i den ordning de kommer att användas. Dessa komponenter hanterar finkornig åtkomstkontroll till resurser i Trac. Standardinställningen är DefaultPermissionPolicy (beteende före 0.11) och LegacyAttachmentPolicy (knyter ATTACHMENT_*-behörigheter till lokalt specifika behörigheter).

source: Database connection [wiki:TracEnvironment#DatabaseConnectionStrings string] for this project
sv: Databasens [wiki:TracEnvironment#DatabaseConnectionStrings anslutningssträng] för detta projekt.

source: Database backup location
sv: Sökväg till databasens backup

source: Timeout value for database connection, in seconds. Use '0' to specify ''no timeout''. ''(Since 0.11)''
sv: Timeout-värde för databasanslutning, i sekunder. Sätt '0' för att ange ''ingen timeout''. (''sedan 0.11'')

source: Show the SQL queries in the Trac log, at DEBUG level. ''(Since 0.11.5)''
sv: Visa SQL-frågor i Trac-loggen, på DEBUG-nivå. (''sedan 0.11.5'')

source: Location of mysqldump for MySQL database backups
sv: Sökväg till mysqldump för backup av MySQL-databaser

source: Location of pg_dump for Postgres database backups
sv: Sökväg till mysqldump för backup av Postgres-databaser

source: Paths to sqlite extensions, relative to Trac environment's directory or absolute. (''since 0.12'')
sv: Sökväg till SQLite Extensions, relativt Trac-miljöns katalog eller absolut. (''sedan 0.12'')

source: Charset to be used when in doubt.
sv: Teckenuppsättning som ska användas vid tveksamheter.

source: Displayed tab width in file preview. (''since 0.9'')
sv: Visad flikbredd vid förhandsgranskning av filen. (''sedan 0.9'')

source: Maximum file size for HTML preview. (''since 0.9'')
sv: Maximal filtstorlek för förhandsgranskning i webbläsaren. (''sedan 0.9'')

source: List of additional MIME types and keyword mappings. Mappings are comma-separated, and for each MIME type, there's a colon (":") separated list of associated keywords or file extensions. (''since 0.10'')
sv: Lista över ytterligare MIME-typer och kopplingar till nyckelord. Kopplingarna är kommaseparerade, och för varje MIME-typ anges en kolonseparerad lista av associerade nyckelord eller filtyper. (''sedan 0.10'')

source: List of additional MIME types associated to filename patterns. Mappings are comma-separated, and each mapping consists of a MIME type and a Python regexp used for matching filenames, separated by a colon (":"). (''since 1.0'')
sv: Förteckning över kompletterande MIME-typer associerade till filnamnsmönster. Mappningarna är kommaseparerade, och varje mappning består av en MIME-typ och en Python-regexp för matchande filnamn, åtskilda av kolon (":"). (''sedan 1.0'')

source: Comma-separated list of MIME types that should be treated as binary data. (''since 0.11.5'')
sv: Kommaseparerad list av MIME-typer som ska behandlas som binär data. (''sedan 0.11.5'')

source: The default style to use for Pygments syntax highlighting.
sv: Standardstil som ska användas för Pygments syntaxfärgläggning.

source: List of additional MIME types known by Pygments. For each, a tuple `mimetype:mode:quality` has to be specified, where `mimetype` is the MIME type, `mode` is the corresponding Pygments mode to be used for the conversion and `quality` is the quality ratio associated to this conversion. That can also be used to override the default quality ratio used by the Pygments render.
sv: Lista av ytterligare MIME-typer som hanteras av Pygments. För varje typ ska `mimetype:mode:quality` specificeras, där `mimetype` anger MIME-typen, `mode` anger motsvarande läge för Pygments som ska gälla vid konvertering och `quality` är kvalitetsgraden för konverteringen. Det kan användas för att överrida den förvalda kvalitetsgraden som används av Pygments-renderaren. (''sedan 0.10'').

source: Minimum length of query string allowed when performing a search.
sv: Minsta tillåten längd på frågesträng vid sökningar.

source: Specifies which search filters should be disabled by default on the search page. This will also restrict the filters for the quick search function. The filter names defined by default components are: `wiki`, `ticket`, `milestone` and `changeset`. For plugins, look for their implementation of the ISearchSource interface, in the `get_search_filters()` method, the first member of returned tuple. Once disabled, search filters can still be manually enabled by the user on the search page. (since 0.12)
sv: Anger sökfilter som ska vara inaktiverade som standard på söksidan. Dessa kommer också vara inaktiverade när snabbsökningsfunktionen används. Filternamnen som definieras av standardkomponenterna är: `wiki`, `ticket`, `milestone` och `changeset`. För insticksmoduler, leta efter deras implementation av gränssnittet ISearchSource och dess metod `get_search_filters()`, filternamnet är det första elementet i den returnerade tuppeln. När ett sökfilter är inaktiverat kan det fortfarande aktiveras manuellt av användaren på söksidan. (''sedan 0.12'')

source: In this section, you can define additional fields for tickets. See TracTicketsCustomFields for more details.
sv: I detta avsnitt kan du definiera ytterligare fält för ärenden. Se TracTicketsCustomFields för mer information.

source: Ordered list of workflow controllers to use for ticket actions (''since 0.11'').
sv: Ordnad lista av hanterare av arbetsflöden, som används vid åtgärder av ärenden. (''sedan 0.11'')

source: Make the owner field of tickets use a drop-down menu. Be sure to understand the performance implications before activating this option. See [TracTickets#Assign-toasDrop-DownList Assign-to as Drop-Down List]. Please note that e-mail addresses are '''not''' obfuscated in the resulting drop-down menu, so this option should not be used if e-mail addresses must remain protected. (''since 0.9'')
sv: Använd en rullgardinsmeny för fältet Ägare i ärenden. Var noga med att förstå prestanda konsekvenserna innan du aktiverar det här alternativet. Se ''[TracTickets#Assign-toasDrop-DownList Assign-to as Drop-Down List]''. Observera att e-postadresser är inte förvrängda i den resulterande rullgardinsmenyn, så detta alternativ ska inte användas om e-postadresser måste förbli skyddade. (''sedan 0.9'')

source: Default version for newly created tickets.
sv: Förvald version för nybildade ärenden.

source: Default type for newly created tickets (''since 0.9'').
sv: Förvald typ för nybildade ärenden. (''sedan 0.9'')

source: Default priority for newly created tickets.
sv: Förvald prioritet för nybildade ärenden.

source: Default milestone for newly created tickets.
sv: Förvald milstolpe för nybildade ärenden.

source: Default component for newly created tickets.
sv: Förvald komponent för nybildade ärenden.

source: Default severity for newly created tickets.
sv: Förvald allvarlighetsgrad för nybildade ärenden.

source: Default summary (title) for newly created tickets.
sv: Förvald sammanfattning (titel) för nybildade ärenden.

source: Default description for newly created tickets.
sv: Förvald beskrivning för nybildade ärenden.

source: Default keywords for newly created tickets.
sv: Förvalda nyckelord för nybildade ärenden.

source: Default owner for newly created tickets.
sv: Förvald ägare för nybildade ärenden.

source: Default cc: list for newly created tickets.
sv: Förvald cc:-lista för nybildade ärenden.

source: Default resolution for resolving (closing) tickets (''since 0.11'').
sv: Förvalt utfall vid lösning (stängning) av ärenden. (''sedan 0.11'')

source: The workflow for tickets is controlled by plugins. By default, there's only a `ConfigurableTicketWorkflow` component in charge. That component allows the workflow to be configured via this section in the `trac.ini` file. See TracWorkflow for more details. (''since 0.11'')
sv: Ärendenas arbetsflöde hanteras av insticksmoduler. Som standard utförs detta av komponenten `ConfigurableTicketWorkflow`. Denna medger att arbetsflödet konfigureras i denna sektion i filen `trac.ini`. Se TracWorkflow för mer detaljer. (''sedan 0.11'')

source: Always send notifications to the ticket owner (''since 0.9'').
sv: Skicka alltid aviseringar till ärendets ägare. (''sedan 0.9'')

source: Always send notifications to any address in the ''reporter'' field.
sv: Skicka alltid aviseringar till någon adress i ''reporter''-fältet.

source: Always send notifications to the person who causes the ticket property change and to any previous updater of that ticket.
sv: Skicka alltid aviseringar till den person som förändrar ärendets egenskaper, och även till varje person som tidigare förändrat samma ärende.

source: A Genshi text template snippet used to get the notification subject. By default, the subject template is `$prefix #$ticket.id: $summary`. `$prefix` being the value of the `smtp_subject_prefix` option. ''(since 0.11)''
sv: En bit av en Genshi-textmall för att erhålla aviseringens ämne. Som standard är mallen `$prefix #$ticket.id: $summary`. `$prefix` är samma som värdet för alternativet `smtp_subject_prefix`. ''(sedan 0.11)''

source: Like ticket_subject_template but for batch modifications. By default, the template is `$prefix Batch modify: $tickets_descr`. ''(since 1.0)''
sv: Liksom `ticket_subject_template` men för batch-ändringar. Som standard är mallen `$prefix Batch modify: $tickets_descr`. (''sedan 1.0'')

source: Which width of ambiguous characters (e.g. 'single' or 'double') should be used in the table of notification mail. If 'single', the same width as characters in US-ASCII. This is expected by most users. If 'double', twice the width of US-ASCII characters. This is expected by CJK users. ''(since 0.12.2)''
sv: Ange bredd för tvetydiga tecken ('single' eller 'double') som ska användas i tabellen i aviseringar. Om 'single' är bredden samma som för teckenuppsättningen US-ASCII. Detta förväntas av de flesta användare. Om 'double', dubbla bredden som för US-ASCII. Detta förväntas av användare av CJK. (''sedan 0.12.2'')

source: The default query for authenticated users. The query is either in [TracQuery#QueryLanguage query language] syntax, or a URL query string starting with `?` as used in `query:` [TracQuery#UsingTracLinks Trac links]. (''since 0.11.2'')
sv: Standardfråga för autentiserade användare. Frågan uttrycks antingen i [TracQuery#QueryLanguage sökspråk]-syntax, eller som en URL-söksträng vilken startar med `?` och är på samma form som [TracQuery#UsingTracLinks Trac-länkar] av typen `query:`. (''sedan 0.11.2'')

source: The default query for anonymous users. The query is either in [TracQuery#QueryLanguage query language] syntax, or a URL query string starting with `?` as used in `query:` [TracQuery#UsingTracLinks Trac links]. (''since 0.11.2'')
sv: Standardfråga för anonyma användare. Frågan uttrycks antingen i [TracQuery#QueryLanguage sökspråk]-syntax, eller som en URL-söksträng vilken startar med `?` och är på samma form som [TracQuery#UsingTracLinks Trac-länkar] av typen `query:`. (''sedan 0.11.2'')

source: Number of tickets displayed per page in ticket queries, by default (''since 0.11'')
sv: Förvalt antal ärenden som visas per sida i ärendesökningar. (''sedan 0.11'')

source: Number of tickets displayed per page in ticket reports, by default (''since 0.11'')
sv: Förvalt antal ärenden som visas per sida i ärenderapporter. (''sedan 0.11'')

source: Number of tickets displayed in the rss feeds for reports (''since 0.11'')
sv: Antal ärenden som visas i RSS-flöden för rapporter. (''sedan 0.11'')

source: As the workflow for tickets is now configurable, there can be many ticket states, and simply displaying closed tickets vs. all the others is maybe not appropriate in all cases. This section enables one to easily create ''groups'' of states that will be shown in different colors in the milestone progress bar. Note that the groups can only be based on the ticket //status//, nothing else. In particular, it's not possible to distinguish between different closed tickets based on the //resolution//. Example configuration with three groups, //closed//, //new// and //active// (the default only has closed and active): {{{ # the 'closed' group correspond to the 'closed' tickets closed = closed # .order: sequence number in the progress bar closed.order = 0 # .query_args: optional parameters for the corresponding # query. In this example, the changes from the # default are two additional columns ('created' and # 'modified'), and sorting is done on 'created'. closed.query_args = group=resolution,order=time,col=id,col=summary,col=owner,col=type,col=priority,col=component,col=severity,col=time,col=changetime # .overall_completion: indicates groups that count for overall # completion percentage closed.overall_completion = true new = new new.order = 1 new.css_class = new new.label = new # Note: one catch-all group for other statuses is allowed active = * active.order = 2 # .css_class: CSS class for this interval active.css_class = open # .label: displayed label for this group active.label = in progress }}} The definition consists in a comma-separated list of accepted status. Also, '*' means any status and could be used to associate all remaining states to one catch-all group. The CSS class can be one of: new (yellow), open (no color) or closed (green). Other styles can easily be added using custom CSS rule: `table.progress td.<class> { background: <color> }` to a [TracInterfaceCustomization#SiteAppearance site/style.css] file for example. (''since 0.11'')
sv: Då arbetsflödet för ärenden är konfigurerbart kan det finnas många ärendetillstånd, att då endast visa stängda ärenden kontra alla övriga är kanske inte lämpligt i alla fall. I denna sektion skapas ''grupper'' av tillstånd vilka kommer visas i olika färger i milstolpens förloppsindikator. Notera att grupperna endast kan baseras på ärendets //tillstånd//, inget annat. Framför allt är det inte möjligt att särskilja stängda ärenden baserat på deras //utfall//. Följande är ett exempel med tre grupper; //closed//, //new// och //active// (som standard särskiljs endast //closed// och //active//): {{{ # Gruppen 'closed' motsvarar stängda ärenden ('closed') closed = closed # .order: Sekvensnummer i förloppsindikatorn closed.order = 0 # .query_args: valfritt argument för motsvarande sökfråga. # Detta exempel innebär, utöver standardinställningen, # att två extra kolumner lagts till ('created' och # 'modified' vilket ges av 'col=time,col=changetime' # nedan) samt att sortering baseras på när ärendet # skapats ('order=time' nedan). closed.query_args = group=resolution,order=time,col=id,col=summary,col=owner,col=type,col=priority,col=component,col=severity,col=time,col=changetime # .overall_completion: indikerar huruvida gruppen ingår vid beräkning # av andelen avklarade ärenden closed.overall_completion = true new = new new.order = 1 new.css_class = new new.label = new # Notera: en allomfattande grupp för övriga tillstånd är tillåten active = * active.order = 2 # .css_class: CSS-klass för detta intervall i förloppsindikatorn active.css_class = open # .label: visad etikett för denna grupp active.label = in progress }}} Definitionen består av en kommaseparerad lista av accepterade tillstånd. Dessutom, '*' betyder vilket tillstånd som helst och kan användas för att associera alla övriga tillstånd till en allomfattande grupp. CSS-klassen kan vara en av: new (gul), open (ingen färg) eller closed (grön). Övriga stilar kan enkelt läggas till som en CSS-regel: `table.progress td.<class> { background: <color> }`, till exempel till filen [TracInterfaceCustomization#SiteAppearance site/style.css]. (''sedan 0.11'')

source: Name of the component implementing `ITicketGroupStatsProvider`, which is used to collect statistics on groups of tickets for display in the roadmap views.
sv: Namnet på den komponent som implementerar `ITicketGroupStatsProvider`, vilken samlar ihop statistik över grupper av ärenden, för presentation av tidsplaner.

source: Name of the component implementing `ITicketGroupStatsProvider`, which is used to collect statistics on groups of tickets for display in the milestone views.
sv: Namnet på den komponent som implementerar `ITicketGroupStatsProvider`, vilken samlar ihop statistik över grupper av ärenden för presentation av milstolpar.

source: Enable the display of all ticket changes in the timeline, not only open / close operations (''since 0.9'').
sv: Möjliggör presentation av alla ärenden på tidslinjen, inte enbart öppna / stängda ärenden. (''sedan 0.9'')

source: Don't accept tickets with a too big description. (''since 0.11'').
sv: Acceptera ej ärenden med en för lång beskrivning. (''sedan 0.11'')

source: Don't accept tickets with a too big comment. (''since 0.11.2'')
sv: Acceptera ej ärenden med en för lång kommentar. (''sedan 0.11.2'')

source: Which formatter flavor (e.g. 'html' or 'oneliner') should be used when presenting the description for new tickets. If 'oneliner', the [timeline] abbreviated_messages option applies. (''since 0.11'').
sv: Inriktning på formatteraren (t.ex. 'html' eller 'oneliner') för presentation av nya ärendens beskrivningar. Vid 'oneliner' så gäller alternativet [timeline] abbreviated_messages. (''sedan 0.11'')

source: Whether Wiki formatter should respect the new lines present in the Wiki text. If set to 'default', this is equivalent to 'yes' for new environments but keeps the old behavior for upgraded environments (i.e. 'no'). (''since 0.11'').
sv: Anger huruvida wikiformatteraren ska återspegla radslut i wikitexten. Om 'default' är angivet är detta samma som 'yes' för nya Trac-miljöer, men behåller gammalt beteende för uppgraderade Trac-miljöer (ex.v. 'no'). (''sedan 0.11'')

source: The base query to be used when linkifying values of ticket fields. The query is a URL query string starting with `?` as used in `query:` [TracQuery#UsingTracLinks Trac links]. (''since 0.12'')
sv: Basfråga som används när länkar skapas för ärendefält. Uttrycks som en URL-söksträng vilken startar med `?` och är på samma form som [TracQuery#UsingTracLinks Trac-länkar] av typen `query:`. (''sedan 0.12'')

source: Default number of days displayed in the Timeline, in days. (''since 0.9.'')
sv: Förvalt antal dagar som visas på tidslinjen. (''sedan 0.9'')

source: Maximum number of days (-1 for unlimited) displayable in the Timeline. (''since 0.11'')
sv: Maximalt antal dagar (-1 för obegränsning) som visas på tidslinjen. (''sedan 0.11'')

source: Whether wiki-formatted event messages should be truncated or not. This only affects the default rendering, and can be overriden by specific event providers, see their own documentation. (''Since 0.11'')
sv: Huruvida wikiformatterade händelsemeddelanden förkortas. Detta påverkar endast standardåtergivning, och kan bortses av enstaka leverantörer av händelser, se dokumentation över dessa. (''sedan 0.11'')

source: Comma-separated list of allowed prefixes for repository directories when adding and editing repositories in the repository admin panel. If the list is empty, all repository directories are allowed. (''since 0.12.1'')
sv: Kommaseparerad lista av tillåtna prefix för sökvägar till kataloger med arkiv vid tillägg eller redigering av arkiv i administörspanelen för arkiv. Om listan är tom tillåts alla sökvägar till arkiv. (''sedan 0.12.1'')

source: One of the alternatives for registering new repositories is to populate the `[repositories]` section of the `trac.ini`. This is especially suited for setting up convenience aliases, short-lived repositories, or during the initial phases of an installation. See [TracRepositoryAdmin#Intrac.ini TracRepositoryAdmin] for details about the format adopted for this section and the rest of that page for the other alternatives. (''since 0.12'')
sv: Ett av alternativen för att registrera nya arkiv är att fylla i sektionen `[repositories]` i filen `trac.ini` Det är speciellt användbart för att definiera alias, kortlivade arkiv, eller under en initial fas vid installation. Se [TracRepositoryAdmin#Intrac.ini TracRepositoryAdmin] för detaljer om formatet som gäller i denna sektion, och resten av sidan för övriga alternativ. (''sedan 0.12'')

source: Default repository connector type. (''since 0.10'') This is also used as the default repository type for repositories defined in [[TracIni#repositories-section repositories]] or using the "Repositories" admin panel. (''since 0.12'')
sv: Standardanslutning för arkiv. (''sedan 0.10'') Detta används även som standardtyp för arkiv som definieras i sektionen [TracIni#repositories-section repositories] i filen `trac.ini`, eller vid användning av administratörspanelen "Arkiv". (''sedan 0.12'')

source: Path to the default repository. This can also be a relative path (''since 0.11''). This option is deprecated, and repositories should be defined in the [TracIni#repositories-section repositories] section, or using the "Repositories" admin panel. (''since 0.12'')
sv: Sökväg till standardarkivet. Kan anges som en relativ sökväg. (''sedan 0.11'') Detta alternativ är föråldrat, arkiv bör definieras i sektionen [TracIni#repositories-section repositories] i filen `trac.ini`, eller genom användning av administratörspanelen "Arkiv". (''sedan 0.12'')

source: List of repositories that should be synchronized on every page request. Leave this option empty if you have set up post-commit hooks calling `trac-admin $ENV changeset added` on all your repositories (recommended). Otherwise, set it to a comma-separated list of repository names. Note that this will negatively affect performance, and will prevent changeset listeners from receiving events from the repositories specified here. The default is to synchronize the default repository, for backward compatibility. (''since 0.12'')
sv: Lista av arkiv som ska synkroniseras vid varje sidbegäran. Lämna detta tomt om du har satt upp post-commit hook-skripter som anropar `trac-admin $ENV changeset added` för alla anslutna arkiv (rekommenderas). Om inte, ange en kommaseparerad lista med arkivnamn. Notera att detta påverkar prestanda negativt och förhindrar utskick av händelser om arkivförändringar för de arkiv som listas här. Som standard synkroniseras standardarkivet, för bakåtkompabilitet. (''sedan 0.12'')

source: The path to the Subversion [http://svnbook.red-bean.com/en/1.5/svn.serverconfig.pathbasedauthz.html authorization (authz) file]. To enable authz permission checking, the `AuthzSourcePolicy` permission policy must be added to `[trac] permission_policies`.
sv: Sökvägen till Subversions [http://svnbook.red-bean.com/en/1.5/svn.serverconfig.pathbasedauthz.html auktorisations-fil (authz)]. För att aktivera auktoriseringskontroll måste behörigshetspolicyn `AuthzSourcePolicy` läggas till `[trac] permission_policies`.
