Repository: Stackato-Apps/stackato-apps
Catalog: apps/bloodhound/trac/trac/locale/*/LC_MESSAGES/tracini.po
Languages: sv

source: Every option in the `[interwiki]` section defines one InterWiki prefix. The option name defines the prefix. The option value defines the URL, optionally followed by a description separated from the URL by whitespace. Parametric URLs are supported as well. '''Example:''' {{{ [interwiki] MeatBall = http://www.usemod.com/cgi-bin/mb.pl? PEP = http://www.python.org/peps/pep-$1.html Python Enhancement Proposal $1 tsvn = tsvn: Interact with TortoiseSvn }}}
sv: Varje alternativ i sektionen `[interwiki]` definierar ett InterWiki-prefix. Alternativets namn definierar prefixet, dess värde anger URL:en, valfritt följt av en beskrivning åtskild från URL:enmed blanksteg. Parametriska URL:er stöds också. '''Exempel:''' {{{ [interwiki] MeatBall = http://www.usemod.com/cgi-bin/mb.pl? PEP = http://www.python.org/peps/pep-$1.html Python Enhancement Proposal $1 tsvn = tsvn: Interact with TortoiseSvn }}}

source: Maximum allowed wiki page size in bytes. (''since 0.11.2'')
sv: Maximal storlek (bytes) på wikisidor . (''sedan 0.11.2'')
