Repository: Stackato-Apps/stackato-apps
Catalog: apps/bloodhound/trac/trac/locale/*/LC_MESSAGES/tracini.po
Languages: sv

source: Path to the Enscript executable.
sv: Sökväg till exekveringsfil för Enscript

source: List of additional MIME types known by Enscript. For each, a tuple `mimetype:mode:quality` has to be specified, where `mimetype` is the MIME type, `mode` is the corresponding Enscript mode to be used for the conversion and `quality` is the quality ratio associated to this conversion. That can also be used to override the default quality ratio used by the Enscript render, which is 2 (''since 0.10'').
sv: Lista av övriga MIME-typer som ska hanteras av Enscript. För varje typ ska `mimetype:mode:quality` specificeras, där `mimetype` anger MIME-typen, `mode` anger motsvarande läge för Enscript som ska gälla vid konvertering och `quality` är kvalitetsgraden för konverteringen. Det kan användas för att överrida den förvalda kvalitetsgraden som används av Enscript-renderaren, vilket är 2. (''sedan 0.10'').

source: Path to the PHP executable (''since 0.9'').
sv: Sökväg till exekveringsfil för PHP (''sedan 0.9'').

source: List of additional MIME types known by SilverCity. For each, a tuple `mimetype:mode:quality` has to be specified, where `mimetype` is the MIME type, `mode` is the corresponding SilverCity mode to be used for the conversion and `quality` is the quality ratio associated to this conversion. That can also be used to override the default quality ratio used by the SilverCity render, which is 3 (''since 0.10'').
sv: Lista av övriga MIME-typer som ska hanteras av SilverCity. För varje typ ska `mimetype:mode:quality` specificeras, där `mimetype` anger MIME-typen, `mode` anger motsvarande läge för SilverCity som ska gälla vid konvertering och `quality` är kvalitetsgraden för konverteringen. Det kan användas för att överrida den förvalda kvalitetsgraden som används av SilverCity-renderaren, vilket är 3. (''sedan 0.10'').

source: Location of authz policy configuration file.
sv: Sökväg till konfigurationsfil för auktoriseringspolicies.

source: This section provides a way to add arbitrary permissions to a Trac environment. This can be useful for adding new permissions to use for workflow actions, for example. To add new permissions, create a new section `[extra-permissions]` in your `trac.ini`. Every entry in that section defines a meta-permission and a comma-separated list of permissions. For example: {{{ [extra-permissions] extra_admin = extra_view, extra_modify, extra_delete }}} This entry will define three new permissions `EXTRA_VIEW`, `EXTRA_MODIFY` and `EXTRA_DELETE`, as well as a meta-permissions `EXTRA_ADMIN` that grants all three permissions. If you don't want a meta-permission, start the meta-name with an underscore (`_`): {{{ [extra-permissions] _perms = extra_view, extra_modify }}}
sv: Denna sektion erbjuder ett sätt att lägga till godtyckliga behörigheter till en Trac-miljö. Detta kan vara användbart för att lägga till nya tillstånd att använda för arbetsflödesåtgärder, till exempel. För att skapa nya behörigheter, skapa en ny sektion `[extra-permissions]` i din `trac.ini`. Varje post in denna sektion definierar en meta-behörighet och en komma-separerad lista med behörigheter. Exempel: {{{ [extra-permissions] extra_admin = extra_view, extra_modify, extra_delete }}} Denna post definiererar tre nya behörigheter `EXTRA_VIEW`, `EXTRA_MODIFY` och `EXTRA_DELETE`, såväl som meta-behörigheten `EXTRA_ADMIN` vilken innefattar alla tre behörigheter. Om du inte vill skapa en meta-behörighet inleder du meta-namnet med ett understrykningstecken (`_`): {{{ [extra-permissions] _perms = extra_view, extra_modify }}}

source: Require commands to be enclosed in an envelope. Must be empty or contain two characters. For example, if set to "[]", then commands must be in the form of [closes #4].
sv: Kräv att kommandon ska omslutas. Måste vara tom eller ange två tecken. Till exempel, om det står "[]" måste kommandon anges på formen [closes #4].

source: Commands that close tickets, as a space-separated list.
sv: Kommandon som stänger ärenden, separarade med mellanslag.

source: Commands that add a reference, as a space-separated list. If set to the special value <ALL>, all tickets referenced by the message will get a reference to the changeset.
sv: Kommandon vilka lägger till en referens, separerade med mellanslag. Om detta är satt till värdet <ALL> så kommer alla ärenden som refereras i meddelandet att referera till ändringen.

source: Check that the committer has permission to perform the requested operations on the referenced tickets. This requires that the user names be the same for Trac and repository operations.
sv: Kontrollera att den som ändrar i arkivet är behörig att utföra begärda åtgärder i refererade ärenden. Detta kräver att användarnamnen är samma för Trac som för arkivåtgärder.

source: Send ticket change notification when updating a ticket.
sv: Skicka aviseringar när ett ärende uppdateras.

source: Enable persistent caching of commit tree.
sv: Aktivera bestående cachning av arkiverat träd.

source: Wrap `GitRepository` in `CachedRepository`.
sv: Linda in `GitRepository` i `CachedRepository`.

source: The length at which a sha1 should be abbreviated to (must be >= 4 and <= 40).
sv: Längd som sha1 ska förkortas till (måste vara mellan 4 och 40, inklusive)

source: The minimum length of an hex-string for which auto-detection as sha1 is performed (must be >= 4 and <= 40).
sv: Minsta längd på hex-sträng för vilken automatisk detektering som sha1 görs (måste vara mellan 4 och 40, inklusive)

source: Enable reverse mapping of git email addresses to trac user ids (costly if you have many users).
sv: Aktivera omvänd mappning mellan e-postadresser för git och användarid för trac (kostsamt vid många användare).

source: Use git-committer id instead of git-author id for the changeset ''Author'' field.
sv: Använd git-arkiverarens id istället för git-upphovsmannens id som ändringens ägare.

source: Use git-committer timestamp instead of git-author timestamp for the changeset ''Timestamp'' field.
sv: Använd tidsstämpeln för git-arkiverarens upphovsman istället för tidsstämpeln för git-upphovsmannen som ändringens tidsstämpel.

source: Define charset encoding of paths within git repositories.
sv: Definiera teckenkodning för sökväger i ett git-arkiv.

source: Path to the git executable.
sv: Sökväg till exekveringsfil för git

source: Path to a gitweb-formatted projects.list
sv: Sökväg till en gitwebb-formatterad projektlista

source: Path to the base of your git projects
sv: Sökväg till basen för dina git-projekt

source: Template for project URLs. %s will be replaced with the repo name
sv: Mall för projektets URL. %s byts ut mot arkivets namn

source: Comma separated list of paths categorized as branches. If a path ends with '*', then all the directory entries found below that path will be included. Example: `/trunk, /branches/*, /projectAlpha/trunk, /sandbox/*`
sv: Kommaseparerad lista med sökvägar som kategoriseras som grenar (branches). Om en sökväg slutar på '*' så inluderas alla sökvägar under denna. Exempel: `/trunk, /branches/*, /projectAlpha/trunk, /sandbox/*`

source: Comma separated list of paths categorized as tags. If a path ends with '*', then all the directory entries found below that path will be included. Example: `/tags/*, /projectAlpha/tags/A-1.0, /projectAlpha/tags/A-v1.1`
sv: Kommaseparerad lista med sökvägar som kategoriseras som mörken (tags). Om en sökväg slutar på '*' så inluderas alla sökvägar under denna. Exempel: `/tags/*, /projectAlpha/tags/A-1.0, /projectAlpha/tags/A-v1.1`

source: The TracBrowser for Subversion can interpret the `svn:externals` property of folders. By default, it only turns the URLs into links as Trac can't browse remote repositories. However, if you have another Trac instance (or an other repository browser like [http://www.viewvc.org/ ViewVC]) configured to browse the target repository, then you can instruct Trac which other repository browser to use for which external URL. This mapping is done in the `[svn:externals]` section of the TracIni. Example: {{{ [svn:externals] 1 = svn://server/repos1 http://trac/proj1/browser/$path?rev=$rev 2 = svn://server/repos2 http://trac/proj2/browser/$path?rev=$rev 3 = http://theirserver.org/svn/eng-soft http://ourserver/viewvc/svn/$path/?pathrev=25914 4 = svn://anotherserver.com/tools_repository http://ourserver/tracs/tools/browser/$path?rev=$rev }}} With the above, the `svn://anotherserver.com/tools_repository/tags/1.1/tools` external will be mapped to `http://ourserver/tracs/tools/browser/tags/1.1/tools?rev=` (and `rev` will be set to the appropriate revision number if the external additionally specifies a revision, see the [http://svnbook.red-bean.com/en/1.4/svn.advanced.externals.html SVN Book on externals] for more details). Note that the number used as a key in the above section is purely used as a place holder, as the URLs themselves can't be used as a key due to various limitations in the configuration file parser. Finally, the relative URLs introduced in [http://subversion.apache.org/docs/release-notes/1.5.html#externals Subversion 1.5] are not yet supported. (''since 0.11'')
sv: TracBrowser för Subversion kan tolka egenskapen `svn:externals` för kataloger. Som standard visas bara webbadresser som länkar i Trac då Trac inte kan bläddra i avlägsna arkiv (ej direkt anslutna arkiv). Men om du har satt upp en annan Trac-miljö (eller en annan arkivbläddrare som [http://www.viewvc.org/ ViewVC]) som konfigurerats att bläddra i målarkivet så kan du instruera Trac om vilken bläddrare som ska användas till vilken extern webbadress. Denna mappning görs i sektionen `[svn:externals]` i TracIni. Exempel: {{{ [svn:externals] 1 = svn://server/repos1 http://trac/proj1/browser/$path?rev=$rev 2 = svn://server/repos2 http://trac/proj2/browser/$path?rev=$rev 3 = http://theirserver.org/svn/eng-soft http://ourserver/viewvc/svn/$path/?pathrev=25914 4 = svn://anotherserver.com/tools_repository http://ourserver/tracs/tools/browser/$path?rev=$rev }}} Enligt ovan kommer en svn:external som `svn://anotherserver.com/tools_repository/tags/1.1/tools` att mappas till `http://ourserver/tracs/tools/browser/tags/1.1/tools?rev=` (och `rev` blir tilldelat ett värde om `svn:external`-deklarationen specificerar ett revisionsnummer, se [http://svnbook.red-bean.com/en/1.4/svn.advanced.externals.html SVN-boken om externals] för detaljer). Notera att nummer används som namn på alternativen i sektionen ovan då webbadresserna inte kan användas för det (pga begränsningar vid tolkningar av konfigurationsfiler). Slutligen, de relativa URL:er som infördes i [http://subversion.apache.org/docs/release-notes/1.5.html#externals Subversion 1.5] stöds ej ännu. (''sedan 0.11'')

source: Maximum allowed file size (in bytes) for ticket and wiki attachments.
sv: Maximalt tillåten storlek (bytes) för filer bifogade till wikisidor och ärenden.

source: Maximum allowed total size (in bytes) for an attachment list to be downloadable as a `.zip`. Set this to -1 to disable download as `.zip`. (''since 1.0'')
sv: Maximalt tillåten total storlek (bytes) för att ladda ner bilagor som en `.zip`. Sätt detta till -1 för att inaktivera nerladdning som `.zip`. (''sedan 1.0'')

source: Whether attachments should be rendered in the browser, or only made downloadable. Pretty much any file may be interpreted as HTML by the browser, which allows a malicious user to attach a file containing cross-site scripting attacks. For public sites where anonymous users can create attachments it is recommended to leave this option disabled (which is the default).
sv: Låt webbläsaren visa innehållet i bifogade filer, eller tillåt endast nedladdning. Illasinnade användare kan utnyttja det här genom att bifoga filer innehållande skripter som attackerar andra sajter, eftersom i stort sett vilken fil som helst kan tolkas som HTML av webbläsaren. För publika sajter där anonyma användare tillåts bifoga filer rekommenderas att denna möjlighet är inaktiverad (vilket är standard).

source: This section is used to enable or disable components provided by plugins, as well as by Trac itself. The component to enable/disable is specified via the name of the option. Whether its enabled is determined by the option value; setting the value to `enabled` or `on` will enable the component, any other value (typically `disabled` or `off`) will disable the component. The option name is either the fully qualified name of the components or the module/package prefix of the component. The former enables/disables a specific component, while the latter enables/disables any component in the specified package/module. Consider the following configuration snippet: {{{ [components] trac.ticket.report.ReportModule = disabled webadmin.* = enabled }}} The first option tells Trac to disable the [wiki:TracReports report module]. The second option instructs Trac to enable all components in the `webadmin` package. Note that the trailing wildcard is required for module/package matching. To view the list of active components, go to the ''Plugins'' page on ''About Trac'' (requires `CONFIG_VIEW` [wiki:TracPermissions permissions]). See also: TracPlugins
sv: Denna sektion används för att aktivera eller inaktivera komponenter som tillhandahålls av insticksmoduler såväl som Trac självt. Komponenten som ska aktiveras/inaktiveras anges av alternativets namn i sektionen, dess värde anger om den är aktiverad eller inaktiverad; ange `enabled` eller `on` för att aktivera komponenten, alla andra värden (typiskt `disabled` eller `off`) leder till att komponenten inaktiveras. Alternativets namn är antingen det fullständiga namnet på komponenten eller namnet på modulen/paketet den ingår i. I det första fallet aktiveras/inaktiveras en specifik komponent, medan i det andra fallet aktiveras/inaktiveras samtliga komponenter i en specifik modul eller paket. Betrakta följande exempel: {{{ [components] trac.ticket.report.ReportModule = disabled webadmin.* = enabled }}} Det första alternativet gör att Trac inaktiverar [wiki:TracReports rapportmodulen]. Andra alternativet anger att Trac ska aktivare alla komponenter i `webadmin`-paketet. Notera att det avslutande jokertecknet krävs för att matcha detta mot namnen på alla dess ingående komponenter. För att visa en lista över alla aktiva komponenter, gå till avsnittet ''Installerade tillägg'' på sidan ''[/about Om Trac]'' (kräver [wiki:TracPermissions rättigheten] `CONFIG_VIEW`). Se även: TracPlugins

source: Path to the //shared plugins directory//. Plugins in that directory are loaded in addition to those in the directory of the environment `plugins`, with this one taking precedence. (''since 0.11'')
sv: Sökväg till //katalog med delade insticksmoduler//. Insticksmoduler i denna katalog laddas utöver de som som finns i katalogen `plugins` för Trac-miljön, där denna har företräde. (''sedan 0.11'')

source: Reference URL for the Trac deployment. This is the base URL that will be used when producing documents that will be used outside of the web browsing context, like for example when inserting URLs pointing to Trac resources in notification e-mails.
sv: Referens-URL för driftsatt Trac. Detta är en bas-URL som används för att producera dokument som används utanför webbläsar-sammanhang, som till exempel e-postmeddelanden med URLer som pekar på Trac-resurser.

source: Optionally use `[trac] base_url` for redirects. In some configurations, usually involving running Trac behind a HTTP proxy, Trac can't automatically reconstruct the URL that is used to access it. You may need to use this option to force Trac to use the `base_url` setting also for redirects. This introduces the obvious limitation that this environment will only be usable when accessible from that URL, as redirects are frequently used. ''(since 0.10.5)''
sv: Använd `[trac] base_url` vid omdirigeringar. I vissa konfigurationer, vanligtvis då Trac körs bakom en HTTP-proxy, kan inte Trac automatiskt konstruera en URL baserat på den som används för att nå Trac. Du kan behöva aktivera detta alternativ för att tvinga Trac att använda värdet för `base_url` även vid omdirigeringar. Detta medför naturligtvis en begränsning: denna Trac-miljö blir endast nåbar genom denna URL då omdirigeringar ofta används. ''(sedan 0.10.5)''

source: Restrict cookies to HTTPS connections. When true, set the `secure` flag on all cookies so that they are only sent to the server on HTTPS connections. Use this if your Trac instance is only accessible through HTTPS. (''since 0.11.2'')
sv: Begränsa cookies till HTTPS-anslutningar. Aktivera detta för att sätta `secure`-flaggan i alla cookies så att de endast skickas till servern över HTTPS-anslutningar. Använd detta om din Trac-miljö endast är nåbar över HTTPS. ''(sedan 0.11.2)''

source: Name of the project.
sv: Projektets namn.

source: Short description of the project.
sv: Kort beskrivning av projektet.

source: URL of the main project web site, usually the website in which the `base_url` resides. This is used in notification e-mails.
sv: URL för huvudprojektsajten, vanligtvis en webbsajt inom vilken `base_url` befinner sig. Detta används i e-postmeddelanden.

source: E-Mail address of the project's administrator.
sv: E-postadress till projektets administratör.

source: Base URL of a Trac instance where errors in this Trac should be reported. This can be an absolute or relative URL, or '.' to reference this Trac instance. An empty value will disable the reporting buttons. (''since 0.11.3'')
sv: Bas-URL för en Trac-miljö där fel i denna Trac-miljö ska rapporteras. Detta kan vara en absolut eller relativ URL, eller '.' för att referera till denna Trac-miljö. Sätt ett tomt värde för att avaktivera rapporteringsknapparna. (''sedan 0.11.3'')

source: Page footer text (right-aligned).
sv: Sidfotens text (högerjusterad).

source: URL of the icon of the project.
sv: URL för projektets ikon.

source: Logging facility to use. Should be one of (`none`, `file`, `stderr`, `syslog`, `winlog`).
sv: Loggningstyp som ska användas. Ska vara en av (`none`, `file`, `stderr`, `syslog`, `winlog`).

source: If `log_type` is `file`, this should be a path to the log-file. Relative paths are resolved relative to the `log` directory of the environment.
sv: Om `log_type` är `file`, ska detta ange en sökväg till logg-filen. Relativa sökvägar utgår från katalogen `log` i Trac-miljön.

source: Level of verbosity in log. Should be one of (`CRITICAL`, `ERROR`, `WARN`, `INFO`, `DEBUG`).
sv: Informationsnivån i loggar. Ska vara en av (`CRITICAL`, `ERROR`, `WARN`, `INFO`, `DEBUG`).

source: Custom logging format. If nothing is set, the following will be used: Trac[$(module)s] $(levelname)s: $(message)s In addition to regular key names supported by the Python logger library (see http://docs.python.org/library/logging.html), one could use: - $(path)s the path for the current environment - $(basename)s the last path component of the current environment - $(project)s the project name Note the usage of `$(...)s` instead of `%(...)s` as the latter form would be interpreted by the ConfigParser itself. Example: `($(thread)d) Trac[$(basename)s:$(module)s] $(levelname)s: $(message)s` ''(since 0.10.5)''
sv: Anpassat loggningsformat. Om inget anges används följande: Trac[$(module)s] $(levelname)s: $(message)s Utöver de vanliga nyckelnamnen som stöds av Python's loggningsbibliotek (se http://docs.python.org/library/logging.html) kan följande användas: - $(path)s sökvägen för aktuell Trac-miljö - $(basename)s basnamnet (den sista delen i sökvägen) för aktuell Trac-miljö - $(project)s projektets namn Notera användningen av `$(...)s` istället för of `%(...)s` då den senare skulle tolkas av ConfigParser självt. Exempel: `($(thread)d) Trac[$(basename)s:$(module)s] $(levelname)s: $(message)s` ''(sedan 0.10.5)''

source: Name of the component implementing `IEmailSender`. This component is used by the notification system to send emails. Trac currently provides `SmtpEmailSender` for connecting to an SMTP server, and `SendmailEmailSender` for running a `sendmail`-compatible executable. (''since 0.12'')
sv: Namnet på komponenten som implementerar `IEmailSender`. Denna komponent används av aviseringssystemet för att skicka e-post. Trac erbjuder för närvarande `SmtpEmailSender` för att ansluta till en SMTP-server, och `SendmailEmailSender` för att köra en `sendmail`-kompatibel exekveringsfil.

source: Enable email notification.
sv: Aktivera e-postaviseringar.

source: Sender address to use in notification emails.
sv: Avsändaradress vid utskick av e-postaviseringar.

source: Sender name to use in notification emails.
sv: Avsändarnamn vid utskick av e-postaviseringar.

source: Use the action author as the sender of notification emails. (''since 1.0'')
sv: Använd åtgärdens upphovsman som avsändare av e-postaviseringar. (''sedan 1.0'')

source: Reply-To address to use in notification emails.
sv: Svarsadress vid utskick av e-postaviseringar.

source: Email address(es) to always send notifications to, addresses can be seen by all recipients (Cc:).
sv: E-postadress(er) som alltid ska erhålla aviseringar, adresserna ses mottagarna (Cc:).

source: Email address(es) to always send notifications to, addresses do not appear publicly (Bcc:). (''since 0.10'')
sv: E-postadress(er) som alltid ska erhålla aviseringar, adresserna ses ej av mottagarna (Bcc:).

source: Default host/domain to append to address that do not specify one.
sv: Förvald värd/domän-namn att lägga till adresser som inte anger någon.

source: Comma-separated list of domains that should not be considered part of email addresses (for usernames with Kerberos domains).
sv: Kommaseparerad lista av domäner som inte ska ses som del av e-postadresser (för användarnamn med Kerberos-domäner).

source: Comma-separated list of domains that should be considered as valid for email addresses (such as localdomain).
sv: Kommaseparerad lista av domäner som ska anses giltiga för e-postadresser (t.ex. localdomain).

source: Specifies the MIME encoding scheme for emails. Valid options are 'base64' for Base64 encoding, 'qp' for Quoted-Printable, and 'none' for no encoding, in which case mails will be sent as 7bit if the content is all ASCII, or 8bit otherwise. (''since 0.10'')
sv: Anger MIME-kodning för e-post. Giltiga alternativ är 'base64' för Base64-kodning, 'qp' för Quoted-Printable, och 'none' för ingen kodning, i vilket fall kommer e-post skickas som 7-bitars om allt innehåll är ASCII eller annars som 8-bitars. (''sedan 0.10'')

source: Recipients can see email addresses of other CC'ed recipients. If this option is disabled (the default), recipients are put on BCC. (''since 0.10'')
sv: Mottagare kan se e-postadresserna för andra mottagare (Cc) . Om detta alternativ är inaktiverat (standard), sätts mottagarna upp som Bcc. (''sedan 0.10'')

source: Permit email address without a host/domain (i.e. username only). The SMTP server should accept those addresses, and either append a FQDN or use local delivery. (''since 0.10'')
sv: Tillåt e-postadresser utan värd-/domännamn (dvs endast användarnamn). SMTP-servern måste acceptera sådana adresser, och antingen lägga till ett domännamn eller utföra lokal leverans. (''sedan 0.10'')

source: Text to prepend to subject line of notification emails. If the setting is not defined, then the [$project_name] prefix. If no prefix is desired, then specifying an empty option will disable it. (''since 0.10.1'')
sv: Text att infoga till ämnesraden i e-postmeddelanden. Om inställningen inte är definierad, så används prefixet [$project_name]. Ange tomt värde om inget prefix önskas. (''sedan 0.10.1'')

source: SMTP server hostname to use for email notifications.
sv: Värdnamnet på SMTP-servern för utskick av e-postmeddelanden.

source: SMTP server port to use for email notification.
sv: Portnumret på SMTP-servern för utskick av e-postmeddelanden.
