Repository: Stackato-Apps/stackato-apps
Catalog: apps/bloodhound/trac/trac/locale/*/LC_MESSAGES/tracini.po
Languages: sv

source: The module prefix used in the `authz_file` for the default repository. If left empty, the global section is used.
sv: Modulprefix som ska användas i `authz_file` för standardarkivet. Om tomt så används den globala sektionen.

source: Comma-separated list of version control properties to render as wiki content in the repository browser. (''since 0.11'')
sv: Kommaseparerad lista av versionskontrollegenskaper som ska tolkas som wikitext i arkivbläddraren. (''sedan 0.11'')

source: Comma-separated list of version control properties to render as oneliner wiki content in the repository browser. (''since 0.11'')
sv: Kommaseparerad lista av versionskontrollegenskaper som ska tolkas som enradig wikitext i arkivbläddraren. (''sedan 0.11'')

source: List of repository paths that can be downloaded. Leave this option empty if you want to disable all downloads, otherwise set it to a comma-separated list of authorized paths (those paths are glob patterns, i.e. "*" can be used as a wild card). In a multi-repository environment, the path must be qualified with the repository name if the path does not point to the default repository (e.g. /reponame/trunk). Note that a simple prefix matching is performed on the paths, so aliases won't get automatically resolved. (''since 0.10'')
sv: Lista över sökvägar i arkiv som kan laddas ner. Lämna detta alternativ blankt om du vill inaktivera all nedladdning, ange annars en kommaseparerad lista över tillåtna sökvägar för nerladdning (sökvägarna är s.k. glob-mönster, dvs "*" kan användas som jokertecken). Om flera arkiv är kopplade till Trac-miljön måste sökvägen föregås av arkivnamnet utom då sökväg anges för det förvalda arkivet (t.ex. /reponame/trunk). Notera att enkel prefix-matchning görs på sökvägarna, så alias-namn kommer ej att hittas. (''sedan 0.10'')

source: Enable colorization of the ''age'' column. This uses the same color scale as the source code annotation: blue is older, red is newer. (''since 0.11'')
sv: Aktivera färgsättning av kolumnen ''ålder''. Samma färgskala används som vid visning av filer med radvis revisionsmärkning: blått är äldre, rött är nyare. (''sedan 0.11'')

source: (r,g,b) color triple to use for the color corresponding to the newest color, for the color scale used in ''blame'' or the browser ''age'' column if `color_scale` is enabled. (''since 0.11'')
sv: Färgtrippel (r,g,b) som används för den färg som motsvarar nyast för färgskalan som används vid visning av radvisa ändringar eller kolumnen ''ålder'', om `color_scale` är aktiverat. (''sedan 0.11'')

source: (r,g,b) color triple to use for the color corresponding to the oldest color, for the color scale used in ''blame'' or the browser ''age'' column if `color_scale` is enabled. (''since 0.11'')
sv: Färgtrippel (r,g,b) som används för den färg som motsvarar äldst för färgskalan som används vid visning av radvisa ändringar eller kolumnen ''ålder'', om `color_scale` är aktiverat. (''sedan 0.11'')

source: If set to a value between 0 and 1 (exclusive), this will be the point chosen to set the `intermediate_color` for interpolating the color value. (''since 0.11'')
sv: Om ett värde mellan 0 och 1 (exklusive) sätts, kommer detta bli den punkt som väljs som `intermediate_color` vid interpolation av färgvärdet. (''sedan 0.11'')

source: (r,g,b) color triple to use for the color corresponding to the intermediate color, if two linear interpolations are used for the color scale (see `intermediate_point`). If not set, the intermediate color between `oldest_color` and `newest_color` will be used. (''since 0.11'')
sv: Färgtrippel (r,g,b) som används för den färg som motsvarar mellanliggande färg, om två linjära interpolationer används för färgskalan (se `intermediate_point`). Om ej satt så kommer färgen mellan `oldest_color` och `newest_color` att användas. (''sedan 0.11'')

source: Whether raw files should be rendered in the browser, or only made downloadable. Pretty much any file may be interpreted as HTML by the browser, which allows a malicious user to create a file containing cross-site scripting attacks. For open repositories where anyone can check-in a file, it is recommended to leave this option disabled (which is the default).
sv: Låt webbläsaren visa innehållet i versionshanterade filer, eller tillåt endast nedladdning. Illasinnade användare kan utnyttja det här genom att skapa filer innehållande skripter som attackerar andra sajter, eftersom i stort sett vilken fil som helst kan tolkas som HTML av webbläsaren. För publika arkiv där anonyma användare tillåts checka in filer rekommenderas att denna möjlighet är inaktiverad (vilket är standard).

source: Comma-separated list of version control properties to hide from the repository browser. (''since 0.9'')
sv: Kommaseparerad lista över versionskontrollegenskaper som ska döljas i arkivbläddraren. (''sedan 0.9'')

source: Number of files to show (`-1` for unlimited, `0` to disable). This can also be `location`, for showing the common prefix for the changed files. (since 0.11).
sv: Antal filer som kan visas (`-1` för obegränsat antal, `0` för att inaktivera). Sätt till `location` för att endast visa ett gemensamt prefix över ändrade filer. (''sedan 0.11'')

source: Whether wiki-formatted changeset messages should be multiline or not. If this option is not specified or is false and `wiki_format_messages` is set to true, changeset messages will be single line only, losing some formatting (bullet points, etc).
sv: Ange om wiki-formatterade ändringsmeddelanden presenteras som flerradiga eller inte. Om detta alternativ ej är specifierat eller satt till `false` och `wiki_format_message` är satt till `true`, presenteras ändringsmeddelanden som enkelradiga där viss formattering förloras (punktlistor etc.)

source: Whether consecutive changesets from the same author having exactly the same message should be presented as one event. That event will link to the range of changesets in the log view. (''since 0.11'')
sv: Presentera flera ändringar i följd, av samma författare med samma ändringsmeddelande, som en endaste händelse. Denna händelse länkar till hela serien av ändringar i logg-vyn. (''sedan 0.11'')

source: Maximum number of modified files for which the changeset view will attempt to show the diffs inlined (''since 0.10'').
sv: Maximalt antal modifierade filer för vilka ändringsvyn kommer försöka visa infogade skillnader. (''sedan 0.10'')

source: Maximum total size in bytes of the modified files (their old size plus their new size) for which the changeset view will attempt to show the diffs inlined (''since 0.10'').
sv: Maximal total storlek (i bytes) på modifierade filer (deras gamla storlek plus deras nya storlek) för vilka ändringsvyn kommer försöka visa infogade skillnader. (''sedan 0.10'')

source: Whether wiki formatting should be applied to changeset messages. If this option is disabled, changeset messages will be rendered as pre-formatted text.
sv: Wikiformattera ändringsmeddelanden. Om detta alternativ är inaktiverat, visas ändringsmeddelanden som oformatterad text.

source: Default value for the limit argument in the TracRevisionLog. (''since 0.11'')
sv: Standardvärde för gräns-argumentet i TracRevisionLog. (''sedan 0.11'')

source: Comma-separated list of colors to use for the TracRevisionLog graph display. (''since 1.0'')
sv: Kommaseparerad lista över färger som ska användas av grafvisning i TracRevisionLog. (''sedan 1.0'')

source: Whether the IP address of the user should be checked for authentication (''since 0.9'').
sv: Huruvida användarens IP-adress ska kontrolleras vid autentisering. (''sedan 0.9'')

source: Whether login names should be converted to lower case (''since 0.9'').
sv: Huruvida inloggningsnamn ska konverteras till gemener. (''sedan 0.9'')

source: Lifetime of the authentication cookie, in seconds. This value determines how long the browser will cache authentication information, and therefore, after how much inactivity a user will have to log in again. The default value of 0 makes the cookie expire at the end of the browsing session. (''since 0.12'')
sv: Livslängden för autentiseringscookien, i sekunder. Detta värde avgör hur länge webbläsaren cachelagrar autentiseringsinformationen, och därigenom efter hur lång inaktivitet en användare måste logga in igen. Standardvärdet 0 gör att cookien löper ut vid utgången av sessionen. (''sedan 0.12'')

source: Path for the authentication cookie. Set this to the common base path of several Trac instances if you want them to share the cookie. (''since 0.12'')
sv: Sökväg för autentiseringscookien. Sätt detta till en gemensam sökväg för flera Trac-miljöer om du vill att de delar cookie. (''sedan 0.12'')

source: Path to the //shared templates directory//. Templates in that directory are loaded in addition to those in the environments `templates` directory, but the latter take precedence. (''since 0.11'')
sv: Sökväg till //delad mallkatalog//. Mallar i denna katalog laddas utöver de i Trac-miljöns katalog `templates`, men de senare har företräde. (''sedan 0.11'')

source: Path to the //shared htdocs directory//. Static resources in that directory are mapped to /chrome/shared under the environment URL, in addition to common and site locations. This can be useful in site.html for common interface customization of multiple Trac environments. (''since 1.0'')
sv: Sökväg till //delad htdocs-katalog//. Statiska resurser i denna katalog mappas till /chrome/shared under Trac-miljöns URL, utöver övriga gemensamma platser på sajten. Detta kan vara användbart i filen `site.html` för anpassningar av gränssnittet som är gemensamt för flera Trac-miljöer. (''sedan 1.0'')

source: Automatically reload template files after modification.
sv: Automatisk omladdning av mallfiler vid ändringar av dem.

source: The maximum number of templates that the template loader will cache in memory. The default value is 128. You may want to choose a higher value if your site uses a larger number of templates, and you have enough memory to spare, or you can reduce it if you are short on memory.
sv: Maximalt antal mallar som mall-laddaren kommer att cachelagra i minnet. Standardvärdet är 128. Du kan sätta högre värde om din sajt användar ett stort antal mallar, och du har tillräckligt med minnesutrymme, eller reducera antalet om minnesutrymmet är begränsat.

source: Base URL for serving the core static resources below `/chrome/common/`. It can be left empty, and Trac will simply serve those resources itself. Advanced users can use this together with [TracAdmin trac-admin ... deploy <deploydir>] to allow serving the static resources for Trac directly from the web server. Note however that this only applies to the `<deploydir>/htdocs/common` directory, the other deployed resources (i.e. those from plugins) will not be made available this way and additional rewrite rules will be needed in the web server.
sv: Bas-URL för servering av grundläggande statiska resurser under `/chrome/common/`. Detta kan lämnas tomt, och Trac kommer då själv servera dessa resurser. Avancerade användare kan använda detta ihop med [TracAdmin trac-admin ... deploy <deploydir>] för att åstadkomma att statiska resurser för Trac direkt serveras av webbservern. Notera att detta endast gäller för katalogen `<deploydir>/htdocs/common`, övriga resurser (som används t.ex. av insticksmoduler) blir ej tillgängliga på det här sättet, och ytterligare omskrivningsregler kommer att behövas i webbservern.

source: Location of the jQuery !JavaScript library (version 1.7.2). An empty value loads jQuery from the copy bundled with Trac. Alternatively, jQuery could be loaded from a CDN, for example: http://code.jquery.com/jquery-1.7.2.min.js, http://ajax.aspnetcdn.com/ajax/jQuery/jquery-1.7.2.min.js or https://ajax.googleapis.com/ajax/libs/jquery/1.7.2/jquery.min.js. (''since 1.0'')
sv: Platsen för jQuery !JavaScript-bibioteket (version 1.7.2). Ett tomt värde medför att jQuery laddas från kopian som medföljer Trac. Alternativt kan jQuery laddas från en CDN (Content Delivery Network), till exempel: http://code.jquery.com/jquery-1.7.2.min.js, http://ajax.aspnetcdn.com/ajax/jQuery/jquery-1.7.2.min.js eller https://ajax.googleapis.com/ajax/libs/jquery/1.7.2/jquery.min.js. (''sedan 1.0'')

source: Location of the jQuery UI !JavaScript library (version 1.8.21). An empty value loads jQuery UI from the copy bundled with Trac. Alternatively, jQuery UI could be loaded from a CDN, for example: https://ajax.googleapis.com/ajax/libs/jqueryui/1.8.21/jquery-ui.min.js or http://ajax.aspnetcdn.com/ajax/jquery.ui/1.8.21/jquery-ui.min.js. (''since 1.0'')
sv: Platsen för jQuery UI !JavaScript-biblioteket (version 1.8.21). Ett tomt värde medför att jQuery UI laddas från kopian som medföljer Trac. Alternativt kan jQuery UI laddas från en CDN (Content Delivery Network), till exempel: https://ajax.googleapis.com/ajax/libs/jqueryui/1.8.21/jquery-ui.min.js eller http://ajax.aspnetcdn.com/ajax/jquery.ui/1.8.21/jquery-ui.min.js. (''sedan 1.0'')

source: Location of the theme to be used with the jQuery UI !JavaScript library (version 1.8.21). An empty value loads the custom Trac jQuery UI theme from the copy bundled with Trac. Alternatively, a jQuery UI theme could be loaded from a CDN, for example: https://ajax.googleapis.com/ajax/libs/jqueryui/1.8.21/themes/start/jquery-ui.css or http://ajax.aspnetcdn.com/ajax/jquery.ui/1.8.21/themes/start/jquery-ui.css. (''since 1.0'')
sv: Sökväg till temat som ska användas med jQuery UI !JavaScript-biblioteket (version 1.8.21). Ett tomt värde medför att det anpassade temat för jQuery UI laddas från kopian som medföljer Trac. Alternativt kan ett tema för jQuery UI laddas från en CDN (Content Delivery Network), till exempel: https://ajax.googleapis.com/ajax/libs/jqueryui/1.8.21/themes/start/jquery-ui.css eller http://ajax.aspnetcdn.com/ajax/jquery.ui/1.8.21/themes/start/jquery-ui.css. (''sedan 1.0'')

source: Order of the items to display in the `metanav` navigation bar, listed by IDs. See also TracNavigation.
sv: Ordning på elementen som ska visas i navigationsfältet `metanav`, listade av IDn. Se också TracNavigation.

source: Order of the items to display in the `mainnav` navigation bar, listed by IDs. See also TracNavigation.
sv: Ordning på elementen som ska visas i navigationsfältet `mainnav`, listade av IDn. Se även TracNavigation.

source: URL to link to, from the header logo.
sv: URL att länka till, från huvudlogotypen.

source: URL of the image to use as header logo. It can be absolute, server relative or relative. If relative, it is relative to one of the `/chrome` locations: `site/your-logo.png` if `your-logo.png` is located in the `htdocs` folder within your TracEnvironment; `common/your-logo.png` if `your-logo.png` is located in the folder mapped to the [#trac-section htdocs_location] URL. Only specifying `your-logo.png` is equivalent to the latter.
sv: URL till bilden som utgör huvudlogotypen. Den kan vara absolut, serverrelativ eller relativ. Om relativ URL, så är den relativ en av `/chrome`-platserna: Ange `site/din-logo.png` om `din-logo.png` är placerad i katalogen `htdocs` inom din [TracEnvironment Trac-miljö]; Ange `common/din-logo.png` om `din-logo.png` är placerad i den katalog som pekas ut av [#trac-section htdocs_location] URL. Om endast `din-logo.png` anges är detta ekvivalent med det senare.

source: Alternative text for the header logo.
sv: Alternativ text för huvudlogotyp.

source: Width of the header logo image in pixels.
sv: Bredden på huvudlogotypen (antal pixlar).

source: Height of the header logo image in pixels.
sv: Höjden på huvudlogotypen (antal pixlar).

source: Show email addresses instead of usernames. If false, we obfuscate email addresses. (''since 0.11'')
sv: Visa e-postadresser istället för användarnamn. Om `false` så fördunklas e-postadresserna. (''sedan 0.11'')

source: Never obfuscate `mailto:` links explicitly written in the wiki, even if `show_email_addresses` is false or the user has not the EMAIL_VIEW permission (''since 0.11.6'').
sv: Fördunkla aldrig `mailto:`-länkar som explicit anges i wikin, även om `show_email_addresses` är satt till `false` eller om användaren ej har behörigheten EMAIL_PREVIEW. (''sedan 0.11.6'')

source: Show IP addresses for resource edits (e.g. wiki). (''since 0.11.3'')
sv: Visa IP-adresser för resursändringar (t.ex. wiki). (''sedan 0.11.3'')

source: Make `<textarea>` fields resizable. Requires !JavaScript. (''since 0.12'')
sv: Gör storleken på `<textarea>`-fält ändringsbar. Kräver !JavaScript. (''sedan 0.12'')

source: Inactivity timeout in seconds after which the automatic wiki preview triggers an update. This option can contain floating-point values. The lower the setting, the more requests will be made to the server. Set this to 0 to disable automatic preview. The default is 2.0 seconds. (''since 0.12'')
sv: Timeout för inaktivitet (i sekunder) efter vilken den automatiska wiki-förhandsgranskningen utlöser en uppdatering. Detta värde kan anges som ett flyttal (med decimalpunkt). Ju lägre inställning, ju fler förfrågningar kommer skickas till servern. Sätt till 0 för att inaktivera automatisk förhandsgranskning. Standard är 2.0 sekunder.

source: The date information format. Valid options are 'relative' for displaying relative format and 'absolute' for displaying absolute format. (''since 1.0'')
sv: Datumformat. Giltiga val är 'relative' för att visa relativa datum (ålder) och 'absolute' för att visa absoluta datum. (''sedan 1.0'')

source: Ordered list of filters to apply to all requests (''since 0.10'').
sv: Ordnad lista med filter som tillämpas på alla förfrågningar. (''sedan 0.10'')

source: Name of the component that handles requests to the base URL. Options include `TimelineModule`, `RoadmapModule`, `BrowserModule`, `QueryModule`, `ReportModule`, `TicketModule` and `WikiModule`. The default is `WikiModule`. (''since 0.9'')
sv: Namnet på den komponent som hanterar förfrågningar till bas-URL:en. Alternativen är bland annat `TimelineModule`, `RoadmapModule`, `BrowserModule`, `QueryModule`, `ReportModule`, `TicketModule` och `WikiModule`. Standard är `WikiModule`. (''sedan 0.9'')

source: The default timezone to use
sv: Förinställd tidszon som ska användas

source: The preferred language to use if no user preference has been set. (''since 0.12.1'')
sv: Önskat språk att använda om inte användaren angivit detta. (''sedan 0.12.1'')

source: The date format. Valid options are 'iso8601' for selecting ISO 8601 format, or leave it empty which means the default date format will be inferred from the browser's default language. (''since 1.0'')
sv: Datumformat. Giltiga alternativ är 'iso8601' för ISO 8601-format, eller lämna tomt för att låta formatet bestämmas av webbläsarens standardinställningar. (''sedan 1.0'')

source: When true, send a `X-Sendfile` header and no content when sending files from the filesystem, so that the web server handles the content. This requires a web server that knows how to handle such a header, like Apache with `mod_xsendfile` or lighttpd. (''since 1.0'')
sv: Aktivera detta för att skicka ett `X-Sendfile`-huvud utan innehåll när filer skickas från filsystemet, så att webbservern hanterar innehållet. Detta kräver en webbserver som kan hantera sådana huvuden, som Apache med `mod_xsendfile` eller lighttpd. (''sedan 1.0'')

source: Enable/disable highlighting CamelCase links to missing pages (''since 0.9'').
sv: Aktivera/inaktivera framhävning av CamelCase-länkar till saknade sidor. (''sedan 0.9'')

source: Enable/disable splitting the WikiPageNames with space characters (''since 0.10'').
sv: Aktivera/inaktivera uppdelning av WikiPageNames med mellanslag. (''sedan 0.10'')

source: Enable/disable the use of unsafe HTML tags such as `<script>` or `<embed>` with the HTML [wiki:WikiProcessors WikiProcessor] (''since 0.10.4''). For public sites where anonymous users can edit the wiki it is recommended to leave this option disabled (which is the default).
sv: Aktivera/inaktivera användning av osäkra HTML-taggar såsom `<script>` eller `<embed>` med HTML-[wiki:WikiProcessors WikiProcessorn]. (''sedan 0.10.4'') För publika sajter där anonyma användare tillåts redigera wikin rekommenderas att denna möjlighet är inaktiverad (vilket är standard).

source: List of URI schemes considered "safe", that will be rendered as external links even if `[wiki] render_unsafe_content` is `false`. (''since 0.11.8'')
sv: Lista över URI-scheman som anses "säkra", vilka återges som externa länkar även om `[wiki] render_unsafe_content` är satt till `false`. (''sedan 0.11.8'')

source: This section configures InterTrac prefixes. Options in this section whose name contain a "." define aspects of the InterTrac prefix corresponding to the option name up to the ".". Options whose name don't contain a "." define an alias. The `.url` is mandatory and is used for locating the other Trac. This can be a relative URL in case that Trac environment is located on the same server. The `.title` information is used for providing a useful tooltip when moving the cursor over an InterTrac link. The `.compat` option can be used to activate or disable a ''compatibility'' mode: * If the targeted Trac is running a version below [trac:milestone:0.10 0.10] ([trac:r3526 r3526] to be precise), then it doesn't know how to dispatch an InterTrac link, and it's up to the local Trac to prepare the correct link. Not all links will work that way, but the most common do. This is called the compatibility mode, and is `true` by default. * If you know that the remote Trac knows how to dispatch InterTrac links, you can explicitly disable this compatibility mode and then ''any'' TracLinks can become InterTrac links. Example configuration: {{{ [intertrac] # -- Example of setting up an alias: t = trac # -- Link to an external Trac: trac.title = Edgewall's Trac for Trac trac.url = http://trac.edgewall.org }}}
sv: Denna sektion konfigurerar InterTrac-prefix. Alternativ i denna sektion vars namn innehåller en punkt "." definierar aspekter av ett InterTrac-prefix motsvarande alternativet med samma namn upp till punkten ".". Alternativ vars namn ej innehåller en punkt "." definierar ett alias. `.url` är obligatoriskt och anger var den andra Trac-miljön är lokaliserad. Detta kan vara en relativ URL om den är placerad på samma server. `.title` används för att tillhandahålla ett användbart verktygstips vid förflyttning av markören över en InterTrac-länk. `.compat` anger huruvida ''kompatibilitetsläget'' ska aktiveras eller inaktiveras: * Om den utpekade Trac-miljön använder en version lägre än [trac:milestone:0.10 0.10] ([trac:r3526 r3526] för att vara exakt) så vet den inte hur en InterTrac-länk ska hanteras, och det ankommer på den refererande Trac-miljön att förbereda en korrekt länk. Inte alla länkar kommer att fungera, men de vanligaste gör det. Detta kallas kompatibilitetsläge, och är `true` som standard. * Om den utpekade Trac-miljön kan hantera InterTrac-länkar kan kompatibilitetsläget inaktiveras vilket medför att ''alla'' [TracLinks Trac-länkar] kan bli till InterTrac-länkar. Exempel på konfiguration: {{{ [intertrac] # -- Examper på alias: t = trac # -- Länka till en extern Trac: trac.title = Edgewall's Trac för Trac trac.url = http://trac.edgewall.org trac.compat = false}}}
